# IsEmpty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSet..::..IsEmpty Property
AssetSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool IsEmpty { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property IsEmpty As Boolean
	Get
```

Visual C++
---
```text
public:
virtual property bool IsEmpty {
	bool get ();
}
```

# See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace